/*
 *===========================================================================================
 *											LJ_RTOS
 *									 The Real-Time Kernel
 * (c) Copyright 2010, 李明浩
 * All Rights Reserved
 *
 * 文件名称：time.c
 * 文件标识：c语言源文件
 * 摘    要：本文件实现与时钟有关函数
 *
 * 当前版本：0.0
 * 作    者：李明浩
 * 完成日期：2010/11/11
 *
 * 取代版本：
 * 作    者：
 * 完成日期：
 *===========================================================================================
 */
 
 #include "timer.h"
 
 static U32 s_delayCount = 0;		/* 定义用于计算延时时间的的静态变量                     */
 
/*
 *===========================================================================================
 * 函数名称：Delay
 * 功能描述：实现系统延时功能
 * 传    参：time (S32)：time > 0, 按指定值进行延时
 *                       time == 0, 使用看门狗实现延时
 * 返 回 值：void
 *===========================================================================================
 */
 void
 Delay( U32 time )
 {
 	int i;
 	int adjust = 0;
 	
 	if ( time == 0 )
 	{
 		time		 = 200;
 		adjust		 = 1;
 		s_delayCount = 800;
 		
 		R_WTCON = ((PCLK / 1000000 - 1) << 8) | (2 << 3); 				/* 预分频器值为49, 分割因子为1/64, 禁止中断，禁止复位 */
 		R_WTDAT = 0xffff;
 		R_WTCNT = 0xffff;
 		R_WTCON = ((PCLK / 1000000 - 1) << 8) | (2 << 3) | (1 << 5);	/* 打开看门狗定时器                                   */
 	}
 	
 	for ( ; time > 0; time-- )
 	{
 		for ( i = 0; i < s_delayCount; i++ )
 			;
 	}
 	
 	if ( adjust == 1 )													/* 计算延时时间, 100us的计数个数                      */
 	{
 		R_WTCON = ((PCLK / 1000000 - 1) << 8) | (2 << 3);				/* 关闭看门狗定时器                                   */
 		i = 0xffff - R_WTCNT;
 		s_delayCount = 16000000 / (i * 64);								/* 200*800 : 64*i = 1*x : 100                         */
 	}
 }
 
/*
 *=================================================================================================
 * 函数名称：Timer0Init
 * 功能描述：初始化Timer0为LJ_RTOS提供时钟节拍
 * 传    参：void
 * 返 回 值：void
 *=================================================================================================
 */
 void
 Timer0Init( void )
 {
 	R_TCON   = R_TCON & (~0xf);					/* 清除手动更新位，停止Timer0                     */
 	R_TCFG0 &= 0xffffff00;						/* 设置 Timer 0&1 预分频序数为 0                  */
 	R_TCFG0 |= 15;								/* 设置 Timer 0&1 预分频序数为15                  */
 	
 	R_TCFG1 &= 0xfffffff0;
 	R_TCFG1 |= 0x00000001;						/* 设置 Timer0的分割器值为1/4                     */
 	R_TCNTB0 = (PCLK / (4 * 15 * LJ_TICKS_PER_SEC)) - 1;
 	
 	R_TCON   = R_TCON & (~0xf) | 0x02;			/* 设置 Timer0的手动更新位                        */
 	R_TCON   = R_TCON & (~0xf) | 0x09;			/* 设置 Timer0的自动装载位，并启动Timer0定时器    */
 }
 